app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Risk Analysis"], ["room_number", 10], ["created_at", "2016-12-31 22:50:04.913325"], ["updated_at", "2016-12-31 22:50:04.913325"]]
---
  def update
    @school_class = SchoolClass.new(params.require(:school_class))
    @school_class.save