app/controllers/students_controller.rb

  def update
    @student = Student.new(params.require(:student))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2016-12-31 22:49:03.887266"], ["updated_at", "2016-12-31 22:49:03.887266"]]